package com.neusoft.uniflow.web.AO.i18n;

import java.util.ListResourceBundle;

public class AO_error_zh_CN extends ListResourceBundle{
    static final Object contents[][] = {
        {"90000","流程模板不存在无法创建实例,模板标识为[{0}]。"},
        {"90001","参数“流程模板标识”为空，无法获取流程模板对象。"},

        {"90100","参数“业务视图名”为空,无法获取业务列名值对工作项列表。"},
        {"90101","参数“业务视图名”为空,无法获取业务列名值对集合。"},
        {"90102","要保存的相关变量名与变量值数量不匹配。"},
        
        {"90200","参数“流程实例标识”为空,无法获取流程实例对象。"},
        {"90201","参数“流程实例对象”为空,无法保存相关变量。"},
        
        {"90300","参数“节点实例标识”为空,无法获取节点实例对象。"},
        {"90400","参数“节点定义标识”为空,无法获取节点定义对象。"},
        
        {"90500","参数“被代理者标识”为空,无法创建代理。"},
        {"90501","参数“代理者标识”为空,无法创建代理。"},
        {"90502","参数“代理时间”为空,无法创建代理。"},
       
    };
    protected Object[][] getContents() {
        return contents;
    }
}
